In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [4]:
inputs=df.drop("Survived",axis="columns")
target=df.Survived

In [5]:
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [6]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [9]:
inputs=pd.concat([inputs,dummies],axis="columns")
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [10]:
inputs.drop(["Sex","male"],axis="columns",inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [19]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [15]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [16]:
inputs.Fare=inputs.Fare.fillna(inputs.Fare.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [25]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [22]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [23]:
model.fit(X_train,y_train)

GaussianNB()

In [24]:
model.score(X_test,y_test)

0.7723880597014925

In [27]:
X_test[0:10]

     Pclass        Age      Fare  female
541       3   9.000000   31.2750       1
256       1  29.695891   79.2000       1
510       3  29.000000    7.7500       0
763       1  36.000000  120.0000       1
523       1  44.000000   57.9792       1
317       2  54.000000   14.0000       0
827       2   1.000000   37.0042       0
575       3  19.000000   14.5000       0
723       2  50.000000   13.0000       0
196       3  29.695891    7.7500       0

In [28]:
y_test[0:10]

541    0
256    1
510    1
763    1
523    1
317    0
827    1
575    0
723    0
196    0
Name: Survived, dtype: int64

In [29]:
model.predict(X_test[0:10])

array([1, 1, 0, 1, 1, 0, 0, 0, 0, 0], dtype=int64)

In [30]:
model.predict_proba(X_test[0:10])

array([[0.29492482, 0.70507518],
       [0.02692462, 0.97307538],
       [0.96329389, 0.03670611],
       [0.00321301, 0.99678699],
       [0.05653857, 0.94346143],
       [0.921016  , 0.078984  ],
       [0.83001232, 0.16998768],
       [0.95731173, 0.04268827],
       [0.92471069, 0.07528931],
       [0.96357439, 0.03642561]])

In [31]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.744     , 0.776     , 0.848     , 0.7983871 , 0.79032258])